## Plan Result (sbox_mgmt)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace
  * module.data_mgmt_zone.azurerm_eventhub_namespace_authorization_rule.eventhub-sender




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace will be created
  + resource "azurerm_eventhub_namespace" "eventhub-namespace" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "uksouth"
      + maximum_throughput_units                  = (known after apply)
      + minimum_tls_version                       = (known after apply)
      + name                                      = "sbox-dlrm-eventhub-ns"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "ingest-mgmt-rg-sbox"
      + sku                                       = "Standard"
      + tags                                      = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      + zone_redundant                            = false
    }

  # module.data_mgmt_zone.azurerm_eventhub_namespace_authorization_rule.eventhub-sender will be created
  + resource "azurerm_eventhub_namespace_authorization_rule" "eventhub-sender" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "dlrm-eventhub-namespace-sender"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":45,"Program":"tfcmt","SHA1":"","Target":"sbox_mgmt","Vars":{}} -->